# Create DataFrame

In [4]:
import pandas as pd
import numpy as np

In [7]:
dates=pd.date_range('today',periods=6) # Define time sequence as row
dates

DatetimeIndex(['2019-12-22 15:38:10.756624', '2019-12-23 15:38:10.756624',
               '2019-12-24 15:38:10.756624', '2019-12-25 15:38:10.756624',
               '2019-12-26 15:38:10.756624', '2019-12-27 15:38:10.756624'],
              dtype='datetime64[ns]', freq='D')

In [8]:
num_arr=np.random.randn(6,4) # Import numpy random array
num_arr

array([[-0.34331325, -0.87018728,  0.59275632, -1.32891093],
       [ 0.24564775, -0.90764504,  1.42716663, -1.36771465],
       [-0.21803534, -0.35118489, -0.35041227,  0.02971571],
       [-0.68358244,  0.48278002, -2.30328578,  0.74138402],
       [ 0.07428781, -1.51472094, -0.71395074,  1.14742646],
       [ 0.60006129,  0.09423653,  1.84594766,  1.35591932]])

In [9]:
columns = ['A', 'B', 'C', 'D'] # use the table as the column name

In [10]:
df1 = pd.DataFrame(num_arr, index = dates, columns = columns)
df1

                                   A         B         C         D
2019-12-22 15:38:10.756624 -0.343313 -0.870187  0.592756 -1.328911
2019-12-23 15:38:10.756624  0.245648 -0.907645  1.427167 -1.367715
2019-12-24 15:38:10.756624 -0.218035 -0.351185 -0.350412  0.029716
2019-12-25 15:38:10.756624 -0.683582  0.482780 -2.303286  0.741384
2019-12-26 15:38:10.756624  0.074288 -1.514721 -0.713951  1.147426
2019-12-27 15:38:10.756624  0.600061  0.094237  1.845948  1.355919

# Create DataFrame

In [92]:
# create DataFrame with dictionary array
data = {'animal':['cat','cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'], 
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [93]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'i']
labels

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'i']

In [94]:
df2 = pd.DataFrame(data, index = labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no

In [42]:
# see datatypes of array
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [45]:
print(df2)
print('-------------------')
df3 = df2.head(6)
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no

In [46]:
print(df2)
print('-------------------')
df4 = df2.tail(2)
df4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------

  animal  age  visits priority
i    dog  7.0       2       no
j    dog  3.0       1       no

In [50]:
print(df2)
print('-------------------')
print(df2.index)
print('-------------------')
print(df2.columns)
print('-------------------')
print(df2.values)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------
Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')
-------------------
Index(['animal', 'age', 'visits', 'priority'], dtype='object')
-------------------
[['cat' 2.5 1 'yes']
 ['cat' 3.0 3 'yes']
 ['snake' 0.5 2 'no']
 ['dog' nan 3 'yes']
 ['dog' 5.0 2 'no']
 ['cat' 2.0 3 'no']
 ['snake' 4.5 1 'no']
 ['cat' nan 1 'yes']
 ['dog' 7.0 2 'no']
 ['dog' 3.0 1 'no']]

In [51]:
# see statitical data of DataFrame
df2.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [53]:
print(df2)
print('-------------------')
# transpose DataFrame
print(df2.T)
print('-------------------')
print(df2)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------
            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5    3    0.5  NaN    5    2    4.5  NaN    7    3
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no  yes   no   no     no  yes   no   no
-------------------
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [63]:
print(df2)
print('-------------------')

df3 = df2.sort_values(by = 'age')

print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------
  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [68]:
# Slice DataFrame
print(df2)

df3 = df2[1 : -1]

df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no

In [69]:
# Slice DataFrame
print(df2)

df3 = df2.sort_values(by = 'age')[1 : -1]

df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes

In [75]:
# slice by column
print(df2)

df3 = df2[['age', 'visits', 'age']]

df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

   age  visits  age
a  2.5       1  2.5
b  3.0       3  3.0
c  0.5       2  0.5
d  NaN       3  NaN
e  5.0       2  5.0
f  2.0       3  2.0
g  4.5       1  4.5
h  NaN       1  NaN
i  7.0       2  7.0
j  3.0       1  3.0

In [77]:
print(df2)
print('-------------------')
df3 = df2.iloc[1:3] # index location, index is row. 
                    # the same as df[1:3]

print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------
  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [78]:
df3 = df2.copy()
print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [81]:
print(df2)
print('-------------------')
print(df2.isnull())

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------
   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [89]:
df3 = df2.copy()
print(df3)
print('-------------------')

df3.loc['f', 'age'] = 1.5

print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
-------------------
   animal  age  visits priority
a     cat  2.5     1.0      yes
b     cat  3.0     3.0      yes
c   snake  0.5     2.0       no
d     dog  NaN     3.0      yes
e     dog  5.0     2.0       no
f     cat  2.0     3.0       no
g   snake  4.5     1.0       no
h     cat  NaN     1.0      yes
i     dog  7.0     2.0       no
j     dog  3.0     1.0       no
ff    NaN  1.5     NaN      NaN

In [98]:
print(df2)
print('-------------------')
df2.mean()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------

age       3.4375
visits    1.9000
dtype: float64

In [99]:
print(df2)
print('-------------------')
df2['age'].mean()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------

3.4375

In [101]:
print(df2)
print('-------------------')
df2.sum()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------

animal      catcatsnakedogdogcatsnakecatdogdog
age                                       27.5
visits                                      19
priority              yesyesnoyesnononoyesnono
dtype: object

In [105]:
string = pd.Series(['A', 'C', 'D', np.nan, 'CBD'])
print(string)
print('-------------------')
str2 = string.str.lower()
print(str2)
print('-------------------')
print(string)

0      A
1      C
2      D
3    NaN
4    CBD
dtype: object
-------------------
0      a
1      c
2      d
3    NaN
4    cbd
dtype: object
-------------------
0      A
1      C
2      D
3    NaN
4    CBD
dtype: object

In [106]:
string = pd.Series(['A', 'C', 'D', np.nan, 'CBD'])
print(string)
print('-------------------')
str2 = string.str.upper()
print(str2)
print('-------------------')
print(string)

0      A
1      C
2      D
3    NaN
4    CBD
dtype: object
-------------------
0      A
1      C
2      D
3    NaN
4    CBD
dtype: object
-------------------
0      A
1      C
2      D
3    NaN
4    CBD
dtype: object

# Operations for DataFrame missing values

In [107]:
df4 = df3.copy()
print(df4)

   animal  age  visits priority
a     cat  2.5     1.0      yes
b     cat  3.0     3.0      yes
c   snake  0.5     2.0       no
d     dog  NaN     3.0      yes
e     dog  5.0     2.0       no
f     cat  2.0     3.0       no
g   snake  4.5     1.0       no
h     cat  NaN     1.0      yes
i     dog  7.0     2.0       no
j     dog  3.0     1.0       no
ff    NaN  1.5     NaN      NaN

In [115]:
df3 = df2.copy()
df4 = df3
print(df3)
print('-------------------')
df4.loc['a', 'animal'] = 'bird'
print(df4)
print('-------------------')
print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------
  animal  age  visits priority
a   bird  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------
  animal  age  visits priority
a   bird  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no

In [118]:
print(df2)
print('-------------------')
df3 = df2.fillna(4)
print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no

In [120]:
s1 = pd.Series(['a', np.nan])
print(s1)
print('-------------------')
s2 = s1.fillna(100)
print(s2)

0      a
1    NaN
dtype: object
-------------------
0      a
1    100
dtype: object

In [124]:
df5 = df2.copy()
print(df5)
print('-------------------')
df6 = df5.dropna(how = 'any')
print(df6)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
i    dog  3.0       1       no

# DataFrame file operations

In [126]:
print(df3)
df3.to_csv('animal.csv')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no

In [127]:
df3 = pd.Series(['a', 'b'])
print(df3)
df3.to_csv('animal.csv')

0    a
1    b
dtype: object

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [135]:
df3 = df2.copy()
df3.to_csv('animal.csv')
print(df3)

df_animal = pd.read_csv('Animal.csv')
df_animal.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no

In [138]:
print(df3)
print('-------------------')
df3.to_excel('animal.xlsx', sheet_name = 'Sheet1')

df_animal2 = pd.read_excel('animal.xlsx', 'Sheet1', index_col = None, na_values = ['NA'])

print(df_animal2)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
i    dog  3.0       1       no
-------------------
  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no
3          d    dog  NaN       3      yes
4          e    dog  5.0       2       no
5          f    cat  2.0       3       no
6          g  snake  4.5       1       no
7          h    cat  NaN       1      yes
8          i    dog  7.0       2       no
9          i    dog  3.0       1       no